SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM22/Include/bgm22_protimer.h
#define _PROTIMER_IF_LBTFAILURE_SHIFT                    25                                         /**< Shift value for PROTIMER_LBTFAILURE         */
#define _PROTIMER_IF_LBTFAILURE_MASK                     0x2000000UL                                /**< Bit mask for PROTIMER_LBTFAILURE            */
#define _PROTIMER_IF_LBTFAILURE_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_LBTFAILURE_DEFAULT                   (_PROTIMER_IF_LBTFAILURE_DEFAULT << 25)    /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_LBTPAUSED                            (0x1UL << 26)                              /**< Listen Before Talk Paused                   */
#define _PROTIMER_IF_LBTPAUSED_SHIFT                     26                                         /**< Shift value for PROTIMER_LBTPAUSED          */
#define _PROTIMER_IF_LBTPAUSED_MASK                      0x4000000UL                                /**< Bit mask for PROTIMER_LBTPAUSED             */
#define _PROTIMER_IF_LBTPAUSED_DEFAULT                   0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_LBTPAUSED_DEFAULT                    (_PROTIMER_IF_LBTPAUSED_DEFAULT << 26)     /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_LBTRETRY                             (0x1UL << 27)                              /**< Listen Before Talk Retry                    */
#define _PROTIMER_IF_LBTRETRY_SHIFT                      27                                         /**< Shift value for PROTIMER_LBTRETRY           */
#define _PROTIMER_IF_LBTRETRY_MASK                       0x8000000UL                                /**< Bit mask for PROTIMER_LBTRETRY              */
#define _PROTIMER_IF_LBTRETRY_DEFAULT                    0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_LBTRETRY_DEFAULT                     (_PROTIMER_IF_LBTRETRY_DEFAULT << 27)      /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_RTCCSYNCHED                          (0x1UL << 28)                              /**< PROTIMER synchronized with the RTCC         */
#define _PROTIMER_IF_RTCCSYNCHED_SHIFT                   28                                         /**< Shift value for PROTIMER_RTCCSYNCHED        */
#define _PROTIMER_IF_RTCCSYNCHED_MASK                    0x10000000UL                               /**< Bit mask for PROTIMER_RTCCSYNCHED           */
#define _PROTIMER_IF_RTCCSYNCHED_DEFAULT                 0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_RTCCSYNCHED_DEFAULT                  (_PROTIMER_IF_RTCCSYNCHED_DEFAULT << 28)   /**< Shifted mode DEFAULT for PROTIMER_IF        */
#define PROTIMER_IF_TOUT0MATCHLBT                        (0x1UL << 29)                              /**< TOUT0 compare match interrupt flag          */
#define _PROTIMER_IF_TOUT0MATCHLBT_SHIFT                 29                                         /**< Shift value for PROTIMER_TOUT0MATCHLBT      */
#define _PROTIMER_IF_TOUT0MATCHLBT_MASK                  0x20000000UL                               /**< Bit mask for PROTIMER_TOUT0MATCHLBT         */
#define _PROTIMER_IF_TOUT0MATCHLBT_DEFAULT               0x00000000UL                               /**< Mode DEFAULT for PROTIMER_IF                */
#define PROTIMER_IF_TOUT0MATCHLBT_DEFAULT                (_PROTIMER_IF_TOUT0MATCHLBT_DEFAULT << 29) /**< Shifted mode DEFAULT for PROTIMER_IF        */

/* Bit fields for PROTIMER IEN */
#define _PROTIMER_IEN_RESETVALUE                         0x00000000UL                                /**< Default value for PROTIMER_IEN              */
#define _PROTIMER_IEN_MASK                               0x3FFFFFF7UL                                /**< Mask for PROTIMER_IEN                       */
#define PROTIMER_IEN_PRECNTOF                            (0x1UL << 0)                                /**< PRECNTOF Interrupt Enable                   */
#define _PROTIMER_IEN_PRECNTOF_SHIFT                     0                                           /**< Shift value for PROTIMER_PRECNTOF           */
#define _PROTIMER_IEN_PRECNTOF_MASK                      0x1UL                                       /**< Bit mask for PROTIMER_PRECNTOF              */
#define _PROTIMER_IEN_PRECNTOF_DEFAULT                   0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_PRECNTOF_DEFAULT                    (_PROTIMER_IEN_PRECNTOF_DEFAULT << 0)       /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_BASECNTOF                           (0x1UL << 1)                                /**< BASECNTOF Interrupt Enable                  */
#define _PROTIMER_IEN_BASECNTOF_SHIFT                    1                                           /**< Shift value for PROTIMER_BASECNTOF          */
#define _PROTIMER_IEN_BASECNTOF_MASK                     0x2UL                                       /**< Bit mask for PROTIMER_BASECNTOF             */
#define _PROTIMER_IEN_BASECNTOF_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_BASECNTOF_DEFAULT                   (_PROTIMER_IEN_BASECNTOF_DEFAULT << 1)      /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_WRAPCNTOF                           (0x1UL << 2)                                /**< WRAPCNTOF Interrupt Enable                  */
#define _PROTIMER_IEN_WRAPCNTOF_SHIFT                    2                                           /**< Shift value for PROTIMER_WRAPCNTOF          */
#define _PROTIMER_IEN_WRAPCNTOF_MASK                     0x4UL                                       /**< Bit mask for PROTIMER_WRAPCNTOF             */
#define _PROTIMER_IEN_WRAPCNTOF_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_WRAPCNTOF_DEFAULT                   (_PROTIMER_IEN_WRAPCNTOF_DEFAULT << 2)      /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_TOUT0                               (0x1UL << 4)                                /**< TOUT0 Interrupt Enable                      */
#define _PROTIMER_IEN_TOUT0_SHIFT                        4                                           /**< Shift value for PROTIMER_TOUT0              */
#define _PROTIMER_IEN_TOUT0_MASK                         0x10UL                                      /**< Bit mask for PROTIMER_TOUT0                 */
#define _PROTIMER_IEN_TOUT0_DEFAULT                      0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_TOUT0_DEFAULT                       (_PROTIMER_IEN_TOUT0_DEFAULT << 4)          /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_TOUT1                               (0x1UL << 5)                                /**< TOUT1 Interrupt Enable                      */
#define _PROTIMER_IEN_TOUT1_SHIFT                        5                                           /**< Shift value for PROTIMER_TOUT1              */
#define _PROTIMER_IEN_TOUT1_MASK                         0x20UL                                      /**< Bit mask for PROTIMER_TOUT1                 */
#define _PROTIMER_IEN_TOUT1_DEFAULT                      0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_TOUT1_DEFAULT                       (_PROTIMER_IEN_TOUT1_DEFAULT << 5)          /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_TOUT0MATCH                          (0x1UL << 6)                                /**< TOUT0MATCH Interrupt Enable                 */
#define _PROTIMER_IEN_TOUT0MATCH_SHIFT                   6                                           /**< Shift value for PROTIMER_TOUT0MATCH         */
#define _PROTIMER_IEN_TOUT0MATCH_MASK                    0x40UL                                      /**< Bit mask for PROTIMER_TOUT0MATCH            */
#define _PROTIMER_IEN_TOUT0MATCH_DEFAULT                 0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_TOUT0MATCH_DEFAULT                  (_PROTIMER_IEN_TOUT0MATCH_DEFAULT << 6)     /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_TOUT1MATCH                          (0x1UL << 7)                                /**< TOUT1MATCH Interrupt Enable                 */
#define _PROTIMER_IEN_TOUT1MATCH_SHIFT                   7                                           /**< Shift value for PROTIMER_TOUT1MATCH         */
#define _PROTIMER_IEN_TOUT1MATCH_MASK                    0x80UL                                      /**< Bit mask for PROTIMER_TOUT1MATCH            */
#define _PROTIMER_IEN_TOUT1MATCH_DEFAULT                 0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_TOUT1MATCH_DEFAULT                  (_PROTIMER_IEN_TOUT1MATCH_DEFAULT << 7)     /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_CC0                                 (0x1UL << 8)                                /**< CC0 Interrupt Enable                        */
#define _PROTIMER_IEN_CC0_SHIFT                          8                                           /**< Shift value for PROTIMER_CC0                */
#define _PROTIMER_IEN_CC0_MASK                           0x100UL                                     /**< Bit mask for PROTIMER_CC0                   */
#define _PROTIMER_IEN_CC0_DEFAULT                        0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_CC0_DEFAULT                         (_PROTIMER_IEN_CC0_DEFAULT << 8)            /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_CC1                                 (0x1UL << 9)                                /**< CC1 Interrupt Enable                        */
#define _PROTIMER_IEN_CC1_SHIFT                          9                                           /**< Shift value for PROTIMER_CC1                */
#define _PROTIMER_IEN_CC1_MASK                           0x200UL                                     /**< Bit mask for PROTIMER_CC1                   */
#define _PROTIMER_IEN_CC1_DEFAULT                        0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_CC1_DEFAULT                         (_PROTIMER_IEN_CC1_DEFAULT << 9)            /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_CC2                                 (0x1UL << 10)                               /**< CC2 Interrupt Enable                        */
#define _PROTIMER_IEN_CC2_SHIFT                          10                                          /**< Shift value for PROTIMER_CC2                */
#define _PROTIMER_IEN_CC2_MASK                           0x400UL                                     /**< Bit mask for PROTIMER_CC2                   */
#define _PROTIMER_IEN_CC2_DEFAULT                        0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_CC2_DEFAULT                         (_PROTIMER_IEN_CC2_DEFAULT << 10)           /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_CC3                                 (0x1UL << 11)                               /**< CC3 Interrupt Enable                        */
#define _PROTIMER_IEN_CC3_SHIFT                          11                                          /**< Shift value for PROTIMER_CC3                */
#define _PROTIMER_IEN_CC3_MASK                           0x800UL                                     /**< Bit mask for PROTIMER_CC3                   */
#define _PROTIMER_IEN_CC3_DEFAULT                        0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_CC3_DEFAULT                         (_PROTIMER_IEN_CC3_DEFAULT << 11)           /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_CC4                                 (0x1UL << 12)                               /**< CC4 Interrupt Enable                        */
#define _PROTIMER_IEN_CC4_SHIFT                          12                                          /**< Shift value for PROTIMER_CC4                */
#define _PROTIMER_IEN_CC4_MASK                           0x1000UL                                    /**< Bit mask for PROTIMER_CC4                   */
#define _PROTIMER_IEN_CC4_DEFAULT                        0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_CC4_DEFAULT                         (_PROTIMER_IEN_CC4_DEFAULT << 12)           /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_CC5                                 (0x1UL << 13)                               /**< CC5 Interrupt Enable                        */
#define _PROTIMER_IEN_CC5_SHIFT                          13                                          /**< Shift value for PROTIMER_CC5                */
#define _PROTIMER_IEN_CC5_MASK                           0x2000UL                                    /**< Bit mask for PROTIMER_CC5                   */
#define _PROTIMER_IEN_CC5_DEFAULT                        0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_CC5_DEFAULT                         (_PROTIMER_IEN_CC5_DEFAULT << 13)           /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_CC6                                 (0x1UL << 14)                               /**< CC6 Interrupt Enable                        */
#define _PROTIMER_IEN_CC6_SHIFT                          14                                          /**< Shift value for PROTIMER_CC6                */
#define _PROTIMER_IEN_CC6_MASK                           0x4000UL                                    /**< Bit mask for PROTIMER_CC6                   */
#define _PROTIMER_IEN_CC6_DEFAULT                        0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_CC6_DEFAULT                         (_PROTIMER_IEN_CC6_DEFAULT << 14)           /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_CC7                                 (0x1UL << 15)                               /**< CC7 Interrupt Enable                        */
#define _PROTIMER_IEN_CC7_SHIFT                          15                                          /**< Shift value for PROTIMER_CC7                */
#define _PROTIMER_IEN_CC7_MASK                           0x8000UL                                    /**< Bit mask for PROTIMER_CC7                   */
#define _PROTIMER_IEN_CC7_DEFAULT                        0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_CC7_DEFAULT                         (_PROTIMER_IEN_CC7_DEFAULT << 15)           /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_COF0                                (0x1UL << 16)                               /**< COF0 Interrupt Enable                       */
#define _PROTIMER_IEN_COF0_SHIFT                         16                                          /**< Shift value for PROTIMER_COF0               */
#define _PROTIMER_IEN_COF0_MASK                          0x10000UL                                   /**< Bit mask for PROTIMER_COF0                  */
#define _PROTIMER_IEN_COF0_DEFAULT                       0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_COF0_DEFAULT                        (_PROTIMER_IEN_COF0_DEFAULT << 16)          /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_COF1                                (0x1UL << 17)                               /**< COF1 Interrupt Enable                       */
#define _PROTIMER_IEN_COF1_SHIFT                         17                                          /**< Shift value for PROTIMER_COF1               */
#define _PROTIMER_IEN_COF1_MASK                          0x20000UL                                   /**< Bit mask for PROTIMER_COF1                  */
#define _PROTIMER_IEN_COF1_DEFAULT                       0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_COF1_DEFAULT                        (_PROTIMER_IEN_COF1_DEFAULT << 17)          /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_COF2                                (0x1UL << 18)                               /**< COF2 Interrupt Enable                       */
#define _PROTIMER_IEN_COF2_SHIFT                         18                                          /**< Shift value for PROTIMER_COF2               */
#define _PROTIMER_IEN_COF2_MASK                          0x40000UL                                   /**< Bit mask for PROTIMER_COF2                  */
#define _PROTIMER_IEN_COF2_DEFAULT                       0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_COF2_DEFAULT                        (_PROTIMER_IEN_COF2_DEFAULT << 18)          /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_COF3                                (0x1UL << 19)                               /**< COF3 Interrupt Enable                       */
#define _PROTIMER_IEN_COF3_SHIFT                         19                                          /**< Shift value for PROTIMER_COF3               */
#define _PROTIMER_IEN_COF3_MASK                          0x80000UL                                   /**< Bit mask for PROTIMER_COF3                  */
#define _PROTIMER_IEN_COF3_DEFAULT                       0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_COF3_DEFAULT                        (_PROTIMER_IEN_COF3_DEFAULT << 19)          /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_COF4                                (0x1UL << 20)                               /**< COF4 Interrupt Enable                       */
#define _PROTIMER_IEN_COF4_SHIFT                         20                                          /**< Shift value for PROTIMER_COF4               */
#define _PROTIMER_IEN_COF4_MASK                          0x100000UL                                  /**< Bit mask for PROTIMER_COF4                  */
#define _PROTIMER_IEN_COF4_DEFAULT                       0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_COF4_DEFAULT                        (_PROTIMER_IEN_COF4_DEFAULT << 20)          /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_COF5                                (0x1UL << 21)                               /**< COF5 Interrupt Enable                       */
#define _PROTIMER_IEN_COF5_SHIFT                         21                                          /**< Shift value for PROTIMER_COF5               */
#define _PROTIMER_IEN_COF5_MASK                          0x200000UL                                  /**< Bit mask for PROTIMER_COF5                  */
#define _PROTIMER_IEN_COF5_DEFAULT                       0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_COF5_DEFAULT                        (_PROTIMER_IEN_COF5_DEFAULT << 21)          /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_COF6                                (0x1UL << 22)                               /**< COF6 Interrupt Enable                       */
#define _PROTIMER_IEN_COF6_SHIFT                         22                                          /**< Shift value for PROTIMER_COF6               */
#define _PROTIMER_IEN_COF6_MASK                          0x400000UL                                  /**< Bit mask for PROTIMER_COF6                  */
#define _PROTIMER_IEN_COF6_DEFAULT                       0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_COF6_DEFAULT                        (_PROTIMER_IEN_COF6_DEFAULT << 22)          /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_COF7                                (0x1UL << 23)                               /**< COF7 Interrupt Enable                       */
#define _PROTIMER_IEN_COF7_SHIFT                         23                                          /**< Shift value for PROTIMER_COF7               */
#define _PROTIMER_IEN_COF7_MASK                          0x800000UL                                  /**< Bit mask for PROTIMER_COF7                  */
#define _PROTIMER_IEN_COF7_DEFAULT                       0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_COF7_DEFAULT                        (_PROTIMER_IEN_COF7_DEFAULT << 23)          /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_LBTSUCCESS                          (0x1UL << 24)                               /**< LBTSUCCESS Interrupt Enable                 */
#define _PROTIMER_IEN_LBTSUCCESS_SHIFT                   24                                          /**< Shift value for PROTIMER_LBTSUCCESS         */
#define _PROTIMER_IEN_LBTSUCCESS_MASK                    0x1000000UL                                 /**< Bit mask for PROTIMER_LBTSUCCESS            */
#define _PROTIMER_IEN_LBTSUCCESS_DEFAULT                 0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_LBTSUCCESS_DEFAULT                  (_PROTIMER_IEN_LBTSUCCESS_DEFAULT << 24)    /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_LBTFAILURE                          (0x1UL << 25)                               /**< LBTFAILURE Interrupt Enable                 */
#define _PROTIMER_IEN_LBTFAILURE_SHIFT                   25                                          /**< Shift value for PROTIMER_LBTFAILURE         */
#define _PROTIMER_IEN_LBTFAILURE_MASK                    0x2000000UL                                 /**< Bit mask for PROTIMER_LBTFAILURE            */
#define _PROTIMER_IEN_LBTFAILURE_DEFAULT                 0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_LBTFAILURE_DEFAULT                  (_PROTIMER_IEN_LBTFAILURE_DEFAULT << 25)    /**< Shifted mode DEFAULT for PROTIMER_IEN       */
#define PROTIMER_IEN_LBTPAUSED                           (0x1UL << 26)                               /**< LBTPAUSED Interrupt Enable                  */
#define _PROTIMER_IEN_LBTPAUSED_SHIFT                    26                                          /**< Shift value for PROTIMER_LBTPAUSED          */
#define _PROTIMER_IEN_LBTPAUSED_MASK                     0x4000000UL                                 /**< Bit mask for PROTIMER_LBTPAUSED             */
#define _PROTIMER_IEN_LBTPAUSED_DEFAULT                  0x00000000UL                                /**< Mode DEFAULT for PROTIMER_IEN               */
#define PROTIMER_IEN_LBTPAUSED_DEFAULT                   (_PROTIMER_IEN_LBTPAUSED_DEFAULT << 26)     /**< Shifted mode DEFAULT for PROTIMER_IEN       */
